Repository: Tereami/RevitAreaReinforcement
Catalog: RevitAreaReinforcement/DialogWindowRestoreAreaRebar.*.resx
Languages: ru_ru

# label1.Text
source: If you try to drag the handles of the area reinforcement made by a plugin an error message appear "Lines must be in closed loops".
ru_ru: Если попытаться перетащить за "ручки" контур армирования по площади, созданного плагином, вы получите ошибку "Линии должны образовывать замкнутые контуры".

# label2.Text
source: It's because the contour line are not joined in corners if you create them using API.
ru_ru: При автоматизированном создании "Армирования по площади" его линии не соединяются в углах.

# linkLabel1.Text
source: It's a bug in Revit API.
ru_ru: Это баг в Revit API.

# label3.Text
source: An workaround: go to "Edit boundary", select all lines, "Cut" them and "Paste to the same place". You can do it manually but this pluhin make the same actions automatically.
ru_ru: Способ решения: зайти в редактирование контура, выбрать все линии контура, "Вырезать" и "Вставить по тому же месту". Данный плагин автоматизирует эти действия через имитацию нажатий клавиш на клавиатуре.

# label4.Text
source: Int he first place you should add the shortcus file (plugin imitates the shortcuts keystroke):
ru_ru: Предварительно необходимо добавить файл горячих клавиш:

# label5.Text
source: In Revit go View - Interface - Shortcuts - Import and select this XML file.
ru_ru: В Revit перейдите Вид - Интерфейс - Горячие клавиши - Импорт, выберите этот файл и "Объединить".

# label6.Text
source: Select all the "Area reinforcements" and "Temporary isolate" the, launch this plugin and click Ok, and immediately click on the active view (to set the focus on this view). Plugin will start in 3 seconds. Plase wait all the areas will be processed, do not touch mouse or keyboard. In the end the message will be appeared.
ru_ru: В Revit выберите "Армирование по площади", запустите этот плагин, нажмите Ок и сразу после этого щелкните по рабочему полю Revit (это нужно, чтобы фокус перешел на окно Revit). Плагин запустится через 3 секунды. Не трогайте мышь и клавиатуру до завершения работы.

# label7.Text
source: Speed (define experimentally)
ru_ru: Скорость (подберите экспериментально)

# label8.Text
source: If the plugin works not stable - try to decrease the runnings speed. If the process are interrupted (for example "Save message" has appeared, itc.) please stop the plugin, right-click "H" icon in the system tray and click "Exit".
ru_ru: Если плагин работает нестабильно - попробуйте уменьшить скорость работы. Также работа прервется, если появится окно сохранения файла или любое другое сообщение. Для остановки работы скрипта щелкните правой кнопкой по значку "Н" в трее и выберите "Exit".

# buttonCancel.Text
source: Cancel
ru_ru: Отмена

# label9.Text
source: The plugin hides the area that are processed succesfully, so you should relaunch the plugin only for the areas that are still visible.
ru_ru: Плагин "Скрывает" успешно обработанные зоны "Армирования по площади", поэтому остаются видимыми необработанные зоны, для них плагин нужно будет запустить повторно.

# buttonShowHelp.Text
source: ↓↓↓Show information↓↓↓
ru_ru: ↓↓↓Показать справку↓↓↓

# buttonHideHelp.Text
source: ↑↑↑Hide information↑↑↑
ru_ru: ↑↑↑Скрыть справку↑↑↑

# $this.Text
source: Fix area rebar
ru_ru: Ремонт фоновой арматуры
